spec/html_examples/advanced-code.org
#+TITLE:     advanced-code.org
#+AUTHOR:    Brian Dewey
#+EMAIL:     bdewey@gmail.com
#+DATE:      2009-12-30 Wed
#+DESCRIPTION: More types of code support
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 

Turns out there's more way to do code than just BEGIN_EXAMPLE. 

* Inline examples

This should work:

:   fixed width? how does this work?   
:                         ...........
:                        ............
:                                   .
:                        .  .   .   .
:                        .          ..
:                        ....... .....
:                            .  .
:                            ....

Two ASCII blobs.

* BEGIN_SRC
:PROPERTIES:
:ARCHIVE_TIME: 2009-12-26 Sat 22:16
:ARCHIVE_FILE: ~/brians-brain/content/projects/orgmode_parser.org
:ARCHIVE_OLPATH: &lt;%= @page.title %&gt;/Future Development
:ARCHIVE_CATEGORY: orgmode_parser
:ARCHIVE_TODO: DONE
:END:

And this:

#+BEGIN_SRC ruby
    # Finds all emphasis matches in a string.
    # Supply a block that will get the marker and body as parameters.
    def match_all(str)
      str.scan(@org_emphasis_regexp) do |match|
        yield $2, $3
      end
    end
#+END_SRC

Now let's test case-insensitive code blocks.

#+begin_src ruby
    # Finds all emphasis matches in a string.
    # Supply a block that will get the marker and body as parameters.
    def match_all(str)
      str.scan(@org_emphasis_regexp) do |match|
        yield $2, $3
      end
    end
#+end_src

#+begin_src clojure
(def fib-seq
  (concat
   [0 1]
   ((fn rfib [a b]
        (lazy-cons (+ a b) (rfib b (+ a b)))) 0 1)))
 
user> (take 20 fib-seq)
(0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181)
#+end_src

